/*
 * globalvars.c
 *
 *  Created on: 2025年8月28日
 *      Author: LW
 */

// ----------------------------------------------------------------------
// 头文件
// ----------------------------------------------------------------------
#include "F28x_Project.h"



// ----------------------------------------------------------------------
// 变量定义
// ----------------------------------------------------------------------

//系统状态与标志
int16_t ISR_ADCA1;      // 中断标志
int16_t GridConnected;  //并网/离网模式切换标志

//实时反馈信号
float32_t g_VbusInst; // 直流母线电压实时采样值
float32_t g_VoInst;   // 输出电压实时采样值
float32_t g_LiInst;   // 电感电流实时采样值


//坐标变换参数
float32_t g_Theta ; // 旋转角度(rad)，用于Park和反Park变换
float32_t g_Omega ; // 角频率(rad/s)，ω = 2*PI*f


//用于一段代码的运行时间测量
float32_t time_start;    // 代码段开始时间戳
float32_t time_end;      // 代码段结束时间戳
float32_t exec_time_us;  // 代码段执行时长(微秒)

//用于一个函数的运行时间测量
float32_t sogi_start_time; //SOGI函数开始时间戳
float32_t sogi_end_time;   // SOGI函数结束时间戳
float32_t sogi_time_us;    // SOGI函数执行时长(微秒)

//锁相相位差
float32_t phase_error;

// ----------------------------------------------------------------------
// 函数定义
// ----------------------------------------------------------------------


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_Global_Variable(void)
 功能描述：    初始化系统全局变量
 输入参数：    无
 输出参数：    无
 返 回 值：   无
 其它说明：    a.所有实时测量值初始化为0.0f，确保系统启动时无异常值
            b.中断标志位清零，确保中断处理逻辑正确
 修改日期         版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW              创建
********************************************************************************/
void Init_Global_Variable(void)
{

    ISR_ADCA1 = 0;   // 中断标志 在进入中断时置 1

    // =======================================================
    // 交流电压部分
    // =======================================================

    g_VoInst = 0.0f;       // 输出电压实时采样值

    // =======================================================
    // 交流电流部分
    // =======================================================

    g_LiInst = 0.0f;      // 电感电流实时采样值

    // =======================================================
    // 直流电压部分
    // =======================================================

    g_VbusInst = 0.0f;   // 直流母线电压实时采样值

    // =======================================================
    // 角度 角频率
    // =======================================================

    g_Theta = 0.0f;  // 旋转角度(rad) 用于Park和反Park变换
    g_Omega = 0.0f;  // 角频率(rad/s) ω = 2*PI*f

    time_start=0.0f;    // 代码段开始时间戳
    time_end=0.0f;      // 代码段结束时间戳
    exec_time_us=0.0f;  // 代码段执行时长(微秒)

    sogi_start_time=0.0f;    // SOGI函数开始时间戳
    sogi_end_time=0.0f;      // SOGI函数结束时间戳
    sogi_time_us=0.0f;       // SOGI函数执行时长(微秒)

    phase_error=0.0f;        // 锁相相位差

}


// ---------------------------------
// End of File
// ---------------------------------

